#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_integer.random_fault_domain[1]: Refreshing state... [id=3]
random_integer.random_fault_domain[0]: Refreshing state... [id=2]
module.adb[0].random_password.wallet_password: Refreshing state... [id=none]
oci_objectstorage_bucket.test_bucket[0]: Refreshing state... [id=n/frxfz3gch4zb/b/coa-demo-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # oci_objectstorage_bucket.test_bucket[0] has been deleted
  - resource "oci_objectstorage_bucket" "test_bucket" {
      - access_type           = "NoPublicAccess" -> null
      - approximate_count     = "0" -> null
      - approximate_size      = "0" -> null
      - auto_tiering          = "Disabled" -> null
      - bucket_id             = "ocid1.bucket.oc1.eu-amsterdam-1.aaaaaaaapydi7xycp7egtno25tjgerfcoxkilaapu774beydyt34gim2m46a" -> null
      - compartment_id        = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa" -> null
      - created_by            = "ocid1.user.oc1..aaaaaaaamoz7ype3cfnznsrzxaw3qrq4sjym2mqfcm6fgj3inli2levpxswq" -> null
      - defined_tags          = {
          - "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        } -> null
      - etag                  = "a3a14f9d-7a99-4a94-a541-3f5483d112f2" -> null
      - freeform_tags         = {} -> null
      - id                    = "n/frxfz3gch4zb/b/coa-demo-bucket" -> null
      - is_read_only          = false -> null
      - name                  = "coa-demo-bucket" -> null
      - namespace             = "frxfz3gch4zb" -> null
      - object_events_enabled = false -> null
      - replication_enabled   = false -> null
      - storage_tier          = "Standard" -> null
      - time_created          = "2022-04-12 11:46:31.855 +0000 UTC" -> null
      - versioning            = "Disabled" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.adb_wallet_file[0] will be created
  + resource "local_file" "adb_wallet_file" {
      + content_base64       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./adb_wallet.zip"
      + id                   = (known after apply)
    }

  # null_resource.configure_bastion_host will be created
  + resource "null_resource" "configure_bastion_host" {
      + id = (known after apply)
    }

  # null_resource.configure_cluster_node_flask[0] will be created
  + resource "null_resource" "configure_cluster_node_flask" {
      + id = (known after apply)
    }

  # null_resource.configure_cluster_node_flask[1] will be created
  + resource "null_resource" "configure_cluster_node_flask" {
      + id = (known after apply)
    }

  # oci_core_dhcp_options.DhcpOptions1 will be created
  + resource "oci_core_dhcp_options" "DhcpOptions1" {
      + compartment_id   = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags     = (known after apply)
      + display_name     = "DHCPOptions1"
      + domain_name_type = (known after apply)
      + freeform_tags    = (known after apply)
      + id               = (known after apply)
      + state            = (known after apply)
      + time_created     = (known after apply)
      + vcn_id           = (known after apply)

      + options {
          + custom_dns_servers  = []
          + search_domain_names = (known after apply)
          + server_type         = "VcnLocalPlusInternet"
          + type                = "DomainNameServer"
        }
      + options {
          + custom_dns_servers  = []
          + search_domain_names = [
              + "example.com",
            ]
          + server_type         = (known after apply)
          + type                = "SearchDomain"
        }
    }

  # oci_core_instance.bastion_instance will be created
  + resource "oci_core_instance" "bastion_instance" {
      + availability_domain                 = "NoEK:EU-FRANKFURT-1-AD-2"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name                        = "coa-demo-bastion"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDLJp3uII85NDaLQ6DGCX6TsUDYy4QuA4fFlFQ+eidinSEAQYgFlSqBqgI/WW0acWOlaGhDwmWp0axSHOHEzKr0r56Q9Fkk7qKIONm/CYPZ34ntX2zTOxIoxxfLKeb6eOcFsTEAQ0DbLnwerrNO6UJ965Uo1QsrmnnpG6kgiMJswqr+osXnlBKGLmfEYbZCVhTiONd4SKxk0OLXLygeV+PLMfoWgwWK/d4uEs7HcRSIUsoAcLmS+NoBbm7wwGkrhsaq84k7hT2iX5ojFD4/Zw6woOOPhMl/ouL1DJRX/O2PbtuaSJPiLt+z8qfzyrKVLlQFoQyfDDnXt91x4KD1vFnXqWUWsYviIFtgHcFasppt3miS+qRrZFDyMsMPDoaWt0XuiknwWAzFhyZrFrGDXNEVqH9tWk2ls/EGKiBh55A2q8CjKp7IL0L/DTC+PWLPd+ABMHgEK9pee+A4vPUGYbBuRp8Kr+O/fF3hDfXdDvoJiMCIo7UMJcmB01RCGDr2ehE= pjuarez@pjuarez-mac"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard1.1"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = (known after apply)
          + is_management_disabled   = (known after apply)
          + is_monitoring_disabled   = (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = (known after apply)
        }

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = {
              + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
            }
          + display_name           = "coa-demo-bastionvnic"
          + freeform_tags          = {
              + "Demo" = "COA Change Management Operations Demo"
            }
          + hostname_label         = "coa-demo-bastion"
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = (known after apply)
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = (known after apply)
          + remote_data_volume_type             = (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = (known after apply)
          + networking_bandwidth_in_gbps  = (known after apply)
          + ocpus                         = (known after apply)
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaahnokcgsxs2tyk2uka6aogvexizg3n2v4puqmrbn5d2thaf4bms3q"
          + source_type             = "image"
        }
    }

  # oci_core_instance.web_instance[0] will be created
  + resource "oci_core_instance" "web_instance" {
      + availability_domain                 = "NoEK:EU-FRANKFURT-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name                        = "coa-demo-web0"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDLJp3uII85NDaLQ6DGCX6TsUDYy4QuA4fFlFQ+eidinSEAQYgFlSqBqgI/WW0acWOlaGhDwmWp0axSHOHEzKr0r56Q9Fkk7qKIONm/CYPZ34ntX2zTOxIoxxfLKeb6eOcFsTEAQ0DbLnwerrNO6UJ965Uo1QsrmnnpG6kgiMJswqr+osXnlBKGLmfEYbZCVhTiONd4SKxk0OLXLygeV+PLMfoWgwWK/d4uEs7HcRSIUsoAcLmS+NoBbm7wwGkrhsaq84k7hT2iX5ojFD4/Zw6woOOPhMl/ouL1DJRX/O2PbtuaSJPiLt+z8qfzyrKVLlQFoQyfDDnXt91x4KD1vFnXqWUWsYviIFtgHcFasppt3miS+qRrZFDyMsMPDoaWt0XuiknwWAzFhyZrFrGDXNEVqH9tWk2ls/EGKiBh55A2q8CjKp7IL0L/DTC+PWLPd+ABMHgEK9pee+A4vPUGYbBuRp8Kr+O/fF3hDfXdDvoJiMCIo7UMJcmB01RCGDr2ehE= pjuarez@pjuarez-mac"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard1.1"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = (known after apply)
          + is_management_disabled   = (known after apply)
          + is_monitoring_disabled   = (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = (known after apply)
        }

      + create_vnic_details {
          + assign_public_ip       = "false"
          + defined_tags           = {
              + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
            }
          + display_name           = "coa-demo-web0vnic"
          + freeform_tags          = {
              + "Demo" = "COA Change Management Operations Demo"
            }
          + hostname_label         = "coa-demo-web0"
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = (known after apply)
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = (known after apply)
          + remote_data_volume_type             = (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = (known after apply)
          + networking_bandwidth_in_gbps  = (known after apply)
          + ocpus                         = (known after apply)
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaahnokcgsxs2tyk2uka6aogvexizg3n2v4puqmrbn5d2thaf4bms3q"
          + source_type             = "image"
        }
    }

  # oci_core_instance.web_instance[1] will be created
  + resource "oci_core_instance" "web_instance" {
      + availability_domain                 = "NoEK:EU-FRANKFURT-1-AD-2"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name                        = "coa-demo-web1"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDLJp3uII85NDaLQ6DGCX6TsUDYy4QuA4fFlFQ+eidinSEAQYgFlSqBqgI/WW0acWOlaGhDwmWp0axSHOHEzKr0r56Q9Fkk7qKIONm/CYPZ34ntX2zTOxIoxxfLKeb6eOcFsTEAQ0DbLnwerrNO6UJ965Uo1QsrmnnpG6kgiMJswqr+osXnlBKGLmfEYbZCVhTiONd4SKxk0OLXLygeV+PLMfoWgwWK/d4uEs7HcRSIUsoAcLmS+NoBbm7wwGkrhsaq84k7hT2iX5ojFD4/Zw6woOOPhMl/ouL1DJRX/O2PbtuaSJPiLt+z8qfzyrKVLlQFoQyfDDnXt91x4KD1vFnXqWUWsYviIFtgHcFasppt3miS+qRrZFDyMsMPDoaWt0XuiknwWAzFhyZrFrGDXNEVqH9tWk2ls/EGKiBh55A2q8CjKp7IL0L/DTC+PWLPd+ABMHgEK9pee+A4vPUGYbBuRp8Kr+O/fF3hDfXdDvoJiMCIo7UMJcmB01RCGDr2ehE= pjuarez@pjuarez-mac"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard1.1"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = (known after apply)
          + is_management_disabled   = (known after apply)
          + is_monitoring_disabled   = (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = (known after apply)
        }

      + create_vnic_details {
          + assign_public_ip       = "false"
          + defined_tags           = {
              + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
            }
          + display_name           = "coa-demo-web1vnic"
          + freeform_tags          = {
              + "Demo" = "COA Change Management Operations Demo"
            }
          + hostname_label         = "coa-demo-web1"
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = (known after apply)
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = (known after apply)
          + remote_data_volume_type             = (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = (known after apply)
          + networking_bandwidth_in_gbps  = (known after apply)
          + ocpus                         = (known after apply)
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaahnokcgsxs2tyk2uka6aogvexizg3n2v4puqmrbn5d2thaf4bms3q"
          + source_type             = "image"
        }
    }

  # oci_core_internet_gateway.coa_internet_gateway will be created
  + resource "oci_core_internet_gateway" "coa_internet_gateway" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-IG"
      + enabled        = true
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_nat_gateway.coa_nat_gateway will be created
  + resource "oci_core_nat_gateway" "coa_nat_gateway" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-NAT-GW"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + nat_ip         = (known after apply)
      + public_ip_id   = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group.ATPSecurityGroup will be created
  + resource "oci_core_network_security_group" "ATPSecurityGroup" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "ATPSecurityGroup"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group.SSHSecurityGroup will be created
  + resource "oci_core_network_security_group" "SSHSecurityGroup" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "SSHSecurityGroup"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group.WebSecurityGroup will be created
  + resource "oci_core_network_security_group" "WebSecurityGroup" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "WebSecurityGroup"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_network_security_group_security_rule.ATPSecurityEgressGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "ATPSecurityEgressGroupRule" {
      + description               = (known after apply)
      + destination               = "10.0.0.0/16"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.ATPSecurityIngressGroupRules will be created
  + resource "oci_core_network_security_group_security_rule" "ATPSecurityIngressGroupRules" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "10.0.0.0/16"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 1522
              + min = 1522
            }
        }
    }

  # oci_core_network_security_group_security_rule.SSHSecurityEgressGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "SSHSecurityEgressGroupRule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.SSHSecurityIngressGroupRules will be created
  + resource "oci_core_network_security_group_security_rule" "SSHSecurityIngressGroupRules" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 22
              + min = 22
            }
        }
    }

  # oci_core_network_security_group_security_rule.WebSecurityEgressATPGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "WebSecurityEgressATPGroupRule" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = "NETWORK_SECURITY_GROUP"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.WebSecurityEgressInternetGroupRule will be created
  + resource "oci_core_network_security_group_security_rule" "WebSecurityEgressInternetGroupRule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.WebSecurityIngressGroupRules will be created
  + resource "oci_core_network_security_group_security_rule" "WebSecurityIngressGroupRules" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_route_table.coa_ig_route_table will be created
  + resource "oci_core_route_table" "coa_ig_route_table" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-ig-route-table"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Trafic to public internet to be routed through the IG"
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
        }
    }

  # oci_core_route_table.coa_nat_gw_route_table will be created
  + resource "oci_core_route_table" "coa_nat_gw_route_table" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-nat-gw-route-table"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = "Trafic to public internet to be routed through the NAT GW"
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
        }
    }

  # oci_core_security_list.coa_atp_private_subnet_security_list will be created
  + resource "oci_core_security_list" "coa_atp_private_subnet_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-private_atp-subnet-security-list"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + ingress_security_rules {
          + description = "Allow ingress for listener from 10.0.0.0/16"
          + protocol    = "6"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 1522
              + min = 1522
            }
        }
    }

  # oci_core_security_list.coa_private_subnet_security_list will be created
  + resource "oci_core_security_list" "coa_private_subnet_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-private-subnet-security-list"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + ingress_security_rules {
          + description = "Allow ingress for HTTP:80 from 10.0.0.0/16"
          + protocol    = "6"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_security_list.coa_public_subnet_security_list will be created
  + resource "oci_core_security_list" "coa_public_subnet_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-public-subnet-security-list"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + ingress_security_rules {
          + description = "Allow ingress for HTTPS:443 from anywhere"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = "Allow ingress for HTTPS:80 from anywhere"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_security_list.coa_vcn_security_list will be created
  + resource "oci_core_security_list" "coa_vcn_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags   = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name   = "coa-demo-vcn-security-list"
      + freeform_tags  = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = "egress to anywhere"
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = "Allow ingress for SSH:22 from anywhere"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
      + ingress_security_rules {
          + description = "Ping from inside the vcn"
          + protocol    = "1"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = -1
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = "ping from anywhere"
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
    }

  # oci_core_subnet.coa_atp_private_subnet will be created
  + resource "oci_core_subnet" "coa_atp_private_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.11.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "coa-demo-atp_private-subnet"
      + dns_label                  = "atpprivsubnet"
      + freeform_tags              = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = true
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_subnet.coa_private_subnet will be created
  + resource "oci_core_subnet" "coa_private_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.0.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags               = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + dhcp_options_id            = (known after apply)
      + display_name               = "coa-demo-private-subnet"
      + dns_label                  = "prvsubnet"
      + freeform_tags              = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_subnet.coa_public_subnet will be created
  + resource "oci_core_subnet" "coa_public_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.10.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags               = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + dhcp_options_id            = (known after apply)
      + display_name               = "coa-demo-public-subnet"
      + dns_label                  = "pubsubnet"
      + freeform_tags              = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_vcn.coa_demo_vcn will be created
  + resource "oci_core_vcn" "coa_demo_vcn" {
      + cidr_block               = "10.0.0.0/16"
      + cidr_blocks              = (known after apply)
      + compartment_id           = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + default_dhcp_options_id  = (known after apply)
      + default_route_table_id   = (known after apply)
      + default_security_list_id = (known after apply)
      + defined_tags             = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name             = "coa-demo-vcn"
      + dns_label                = "coavcn"
      + freeform_tags            = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                       = (known after apply)
      + ipv6cidr_blocks          = (known after apply)
      + is_ipv6enabled           = false
      + state                    = (known after apply)
      + time_created             = (known after apply)
      + vcn_domain_name          = (known after apply)
    }

  # oci_load_balancer_backend.coa_backends[0] will be created
  + resource "oci_load_balancer_backend" "coa_backends" {
      + backendset_name  = "coa-demo-backend-set"
      + backup           = false
      + drain            = (known after apply)
      + id               = (known after apply)
      + ip_address       = (known after apply)
      + load_balancer_id = (known after apply)
      + name             = (known after apply)
      + offline          = (known after apply)
      + port             = 80
      + state            = (known after apply)
      + weight           = (known after apply)
    }

  # oci_load_balancer_backend.coa_backends[1] will be created
  + resource "oci_load_balancer_backend" "coa_backends" {
      + backendset_name  = "coa-demo-backend-set"
      + backup           = false
      + drain            = (known after apply)
      + id               = (known after apply)
      + ip_address       = (known after apply)
      + load_balancer_id = (known after apply)
      + name             = (known after apply)
      + offline          = (known after apply)
      + port             = 80
      + state            = (known after apply)
      + weight           = (known after apply)
    }

  # oci_load_balancer_backend_set.coa_backend_set will be created
  + resource "oci_load_balancer_backend_set" "coa_backend_set" {
      + backend          = (known after apply)
      + id               = (known after apply)
      + load_balancer_id = (known after apply)
      + name             = "coa-demo-backend-set"
      + policy           = "ROUND_ROBIN"
      + state            = (known after apply)

      + health_checker {
          + interval_ms         = 10000
          + port                = 80
          + protocol            = "HTTP"
          + response_body_regex = (known after apply)
          + retries             = 3
          + return_code         = 200
          + timeout_in_millis   = 3000
          + url_path            = "/"
        }

      + lb_cookie_session_persistence_configuration {
          + cookie_name        = (known after apply)
          + disable_fallback   = (known after apply)
          + domain             = (known after apply)
          + is_http_only       = (known after apply)
          + is_secure          = (known after apply)
          + max_age_in_seconds = (known after apply)
          + path               = (known after apply)
        }

      + session_persistence_configuration {
          + cookie_name      = (known after apply)
          + disable_fallback = (known after apply)
        }
    }

  # oci_load_balancer_certificate.coa_lbaas_certificate["443"] will be created
  + resource "oci_load_balancer_certificate" "coa_lbaas_certificate" {
      + ca_certificate     = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIE/DCCAuQCCQC9AzQdJRK3rjANBgkqhkiG9w0BAQsFADBAMQswCQYDVQQGEwJl
            czEOMAwGA1UECAwFc3BhaW4xEDAOBgNVBAcMB3NldmlsbGUxDzANBgNVBAoMBm9y
            YWNsZTAeFw0yMjAyMTExMjMxMzRaFw0yNDEyMDExMjMxMzRaMEAxCzAJBgNVBAYT
            AmVzMQ4wDAYDVQQIDAVzcGFpbjEQMA4GA1UEBwwHc2V2aWxsZTEPMA0GA1UECgwG
            b3JhY2xlMIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA1s7mQX+9LFc1
            RwLRIprjl3pOSk3y+sPpMqTr9kJ0zeLE5vZ/aDIU3Vm2WIVyd4AbidaD5U3eUA0Q
            XLskPKRXyLoChcjoaD/+848ju6THi7J8C83dNI27qq7uAJ29mFIYg54rhdQ+5Xq6
            g0TnvjIeKtZIbYHDvHvEyrWjaiKqFdKLn7PejAZ9YuWlUHe3bq9Hf8+Cfg2yFJ9A
            vsGHartg36a0d903UICCyaiK0+CmczZ2EcB+le+zv/LP1L6rz4iq6IMRbsNoeMpj
            MsJH7gYGb2fgSNljrdqCUcywykMqSeUztNZrzOTjcjbTvtJMxaNaOeUbHYIh1hSE
            HIDl/2jKP3vy3SU9/waDdPXXn/axYMTUOUHy9MhggFl952DSrM9DfRzsqBhbu5it
            QeqMxif7M+4gM8UeQRdzxoymnXh6wddxhwjfW3+bKzX5KsjKwy9sZ3TDG0rVkm7v
            Ogv2t8H5JiVz1LOVn5IwYUCGtAgFcmmDbLmd1iVxeiAnl5RY9xona3FSGgW9K8oO
            gXc5KjifGKFkHMFEQKItjAplXGcBXHhMUdeKi7C9HB6uryrMsAtZ+hXcRGk6sqJd
            rube3Xjw0WxgUlIOjmv3Zg0JdDGoZ3fWS57fGaL4h05KXYgVEDkY3QXzO8Bq4lZe
            9jzMKo42oj1+ikHIUCqdsbSQkyXLAjkCAwEAATANBgkqhkiG9w0BAQsFAAOCAgEA
            MEESmt4Gxka6cOzROP7kHyyvC6dnIa4FdiS3zSrHZ2YrMaE/NsIqM1US07yX7/cI
            xZtNQQIaf9nXJRpp5l/3+j227JEq7aclN9a68Wm/ofptGtaIs8EoZx3KmAtvUKLJ
            lkqSR0ZOHR2GDbZ0IZnzwRaolbUz2nuO7X9RvGVrjjfNxEcRhfq9Yr+RHQnldFzK
            y1ODa0hDw81cAtRf1b2P04PgeyykebkmUh/1AxlmPptQu2f/uyg9VIaTOxDa37dY
            ZGuPm516HY2kzUFs+sN38ljsKwo9cizN1uRgtn6SYM1DKjfedc6u5/WuZFR12Av+
            DraoEjXI1euxqqFfa0Z7ZvG1bxcxit91SKGjndsQEMMMvXHHSSaUv5+NxU1C8/3g
            IuDUFQeLkYf4SkyK7wK8Gdz46WONBMIYBUMesdeUJ8dzvx3CUuR+RRkdX4S/LtqY
            L2lyn7gjuPSqBZZYxg/aKyzLKdlijjgiZ/rQAH1tSFLFR5CeVmYOEvyS4bgdOmjQ
            +OhpxY81iNKk1oM4zGzIoF+ZgS99gwqN6EkqAHbL0XQ5t094Mta4Ogf37rh0CBWP
            QLqeSGrlcfq84bQFX8j1COgnxMXqlMFhscIZOw/XVN7fNJy9smF8cv7mb0+UM81l
            /19A3DFdiv31WGs5VMcLoEGI3fAv4AeSyPoqLDYBj78=
            -----END CERTIFICATE-----
        EOT
      + certificate_name   = "coa-demo-coa-lbaas-certificate"
      + id                 = (known after apply)
      + load_balancer_id   = (known after apply)
      + private_key        = (sensitive value)
      + public_certificate = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEBjCCAe4CCQCb+1AZES/6wTANBgkqhkiG9w0BAQsFADBAMQswCQYDVQQGEwJl
            czEOMAwGA1UECAwFc3BhaW4xEDAOBgNVBAcMB3NldmlsbGUxDzANBgNVBAoMBm9y
            YWNsZTAeFw0yMjAyMTExMjMyMzRaFw0yMzA2MjYxMjMyMzRaMEoxCzAJBgNVBAYT
            AlVTMQswCQYDVQQIDAJDQTEYMBYGA1UECgwPU29tZVBsYWNlLCBJbmMuMRQwEgYD
            VQQDDAtteW9yZy5sb2NhbDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEB
            AMaMjT3BgeBtd5jzjdxrG+SoPjL4GtAGNT7UrOOYMELk6rjUTq0lnox7K5mxpUJI
            JuoZmlXMQsBPRN0onoQoQF5cFpJQPVzpkZZWBnj90GzaDBfXIT/eIFyaj0l2DBOh
            zja5r5uGuAqVVoc11y1xNuqY0xiwirY8BysrZSPHutQIJhVGf90uQ8Czb6aTO9c8
            WD17GIVLCjzQvEWqwyEQcuv+wEpys12KW4U5ijJHIt51RC7/qF0bmfXluCQsDD5q
            +V+7e1q5TOYVYT7ihqipc8BI7h6jXcalZUP5C3hGWBQKyrGEp1LotDi25ke2ooFk
            UFU2f51H5SbKfzzXfRYQbi8CAwEAATANBgkqhkiG9w0BAQsFAAOCAgEAK5Ssv+cr
            EXip47Jw06XUFIF2iqpBCalvHmp6XYYbPp/mKNKzoddVmKj45mQL2F9GiPVrP7Hj
            x4vQ88GMn9TFd4az5r/enz60j20dFolhtkI7EE9uRISIER7vuTGnl4gieXN1bpMR
            X2Zuq7Oi/q0jEwkjde3sWZgJuw8zjDOgdhXj/E/6Mnouj8Zod5cBQeik61Xyk/vK
            ZKktJj1ykvKUNkflMWOIhlR/7DUVNrDSHGUqkFFNabPBjUgp4RQyrv43OGbKoEc+
            pNFXPaQReouzaWaVS26Ly7MOJmi+OGyJXB+5TNzgEn9z6Jxaymz7PSLP1y+x4ngw
            BsyDlS98U9N7cw3LnJyuIAzYQ+v4X6dX1P6EY1mxmnyAxMGqxZvCfytZUqhfYVqJ
            eYatI1LDDZe8HfB4byYVUmRclhCmEsWXa/qFlQ/vQq0TwQuxD3A0QdVY9z8VXgGX
            9F5S0WDvfNFmHhXPG4bSUhs0knJGe6bliW2sEoISn00kQh2FT4uZIwUdA++KoOls
            Sahzfj+cp3ljjptBWTSqwBbFuQUtPraLG7b2FhPOd20lfUUYnaI3GJCx39f3jpa7
            XIPzEg4HAH3n4NadZ14oDrQ6uEnuaxtNvhw0XxtFOW3hitL769sXApzx9gpHPTVe
            ANWLp+YJYs8MHoUaZxOYO9BVQpcdUh7+tkM=
            -----END CERTIFICATE-----
        EOT
      + state              = (known after apply)
    }

  # oci_load_balancer_listener.coa_listeners["443"] will be created
  + resource "oci_load_balancer_listener" "coa_listeners" {
      + default_backend_set_name = "coa-demo-backend-set"
      + hostname_names           = (known after apply)
      + id                       = (known after apply)
      + load_balancer_id         = (known after apply)
      + name                     = "coa-demo-listener-443"
      + path_route_set_name      = (known after apply)
      + port                     = 443
      + protocol                 = "HTTP"
      + routing_policy_name      = (known after apply)
      + rule_set_names           = (known after apply)
      + state                    = (known after apply)

      + connection_configuration {
          + backend_tcp_proxy_protocol_version = (known after apply)
          + idle_timeout_in_seconds            = (known after apply)
        }

      + ssl_configuration {
          + certificate_name        = "coa-demo-coa-lbaas-certificate"
          + cipher_suite_name       = (known after apply)
          + protocols               = (known after apply)
          + server_order_preference = (known after apply)
          + verify_depth            = 5
          + verify_peer_certificate = false
        }
    }

  # oci_load_balancer_listener.coa_listeners["80"] will be created
  + resource "oci_load_balancer_listener" "coa_listeners" {
      + default_backend_set_name = "coa-demo-backend-set"
      + hostname_names           = (known after apply)
      + id                       = (known after apply)
      + load_balancer_id         = (known after apply)
      + name                     = "coa-demo-listener-80"
      + path_route_set_name      = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + routing_policy_name      = (known after apply)
      + rule_set_names           = (known after apply)
      + state                    = (known after apply)

      + connection_configuration {
          + backend_tcp_proxy_protocol_version = (known after apply)
          + idle_timeout_in_seconds            = (known after apply)
        }
    }

  # oci_load_balancer_load_balancer.coa_load_balancer will be created
  + resource "oci_load_balancer_load_balancer" "coa_load_balancer" {
      + compartment_id     = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + defined_tags       = {
          + "CCA_Basic_Tag.email" = "oracleidentitycloudservice/paola.juarez@oracle.com"
        }
      + display_name       = "coa-demo-load-balancer"
      + freeform_tags      = {
          + "Demo" = "COA Change Management Operations Demo"
        }
      + id                 = (known after apply)
      + ip_address_details = (known after apply)
      + ip_addresses       = (known after apply)
      + ip_mode            = (known after apply)
      + is_private         = false
      + shape              = "10Mbps"
      + state              = (known after apply)
      + subnet_ids         = (known after apply)
      + system_tags        = (known after apply)
      + time_created       = (known after apply)

      + shape_details {
          + maximum_bandwidth_in_mbps = (known after apply)
          + minimum_bandwidth_in_mbps = (known after apply)
        }
    }

  # oci_objectstorage_bucket.test_bucket[0] will be created
  + resource "oci_objectstorage_bucket" "test_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "coa-demo-bucket"
      + namespace                    = "frxfz3gch4zb"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
      + versioning                   = (known after apply)
    }

  # module.adb[0].oci_database_autonomous_database.adb_database will be created
  + resource "oci_database_autonomous_database" "adb_database" {
      + actual_used_data_storage_size_in_tbs           = (known after apply)
      + admin_password                                 = (sensitive value)
      + allocated_storage_size_in_tbs                  = (known after apply)
      + apex_details                                   = (known after apply)
      + are_primary_whitelisted_ips_used               = (known after apply)
      + autonomous_container_database_id               = (known after apply)
      + autonomous_database_backup_id                  = (known after apply)
      + autonomous_database_id                         = (known after apply)
      + autonomous_maintenance_schedule_type           = "REGULAR"
      + available_upgrade_versions                     = (known after apply)
      + backup_config                                  = (known after apply)
      + clone_type                                     = (known after apply)
      + compartment_id                                 = "ocid1.compartment.oc1..aaaaaaaaes3c3pxlxbcd2upv4vh7wbdfd7vgywuaa75izuu3otrb2omhekaa"
      + connection_strings                             = (known after apply)
      + connection_urls                                = (known after apply)
      + cpu_core_count                                 = 1
      + data_safe_status                               = "NOT_REGISTERED"
      + data_storage_size_in_gb                        = (known after apply)
      + data_storage_size_in_tbs                       = 1
      + database_management_status                     = (known after apply)
      + db_name                                        = "ADBCOADEMO"
      + db_version                                     = "19c"
      + db_workload                                    = "OLTP"
      + defined_tags                                   = (known after apply)
      + display_name                                   = "ADBCOADEMO"
      + failed_data_recovery_in_seconds                = (known after apply)
      + freeform_tags                                  = (known after apply)
      + id                                             = (known after apply)
      + infrastructure_type                            = (known after apply)
      + is_access_control_enabled                      = (known after apply)
      + is_auto_scaling_enabled                        = true
      + is_auto_scaling_for_storage_enabled            = (known after apply)
      + is_data_guard_enabled                          = false
      + is_dedicated                                   = false
      + is_free_tier                                   = false
      + is_mtls_connection_required                    = true
      + is_preview                                     = (known after apply)
      + is_preview_version_with_service_terms_accepted = (known after apply)
      + is_reconnect_clone_enabled                     = (known after apply)
      + is_refreshable_clone                           = (known after apply)
      + key_history_entry                              = (known after apply)
      + key_store_id                                   = (known after apply)
      + key_store_wallet_name                          = (known after apply)
      + kms_key_id                                     = (known after apply)
      + kms_key_lifecycle_details                      = (known after apply)
      + kms_key_version_id                             = (known after apply)
      + license_model                                  = "BRING_YOUR_OWN_LICENSE"
      + lifecycle_details                              = (known after apply)
      + memory_per_oracle_compute_unit_in_gbs          = (known after apply)
      + nsg_ids                                        = (known after apply)
      + ocpu_count                                     = (known after apply)
      + open_mode                                      = (known after apply)
      + operations_insights_status                     = "NOT_ENABLED"
      + permission_level                               = (known after apply)
      + private_endpoint                               = (known after apply)
      + private_endpoint_ip                            = (known after apply)
      + private_endpoint_label                         = "ADBCOADEMO"
      + refreshable_mode                               = (known after apply)
      + refreshable_status                             = (known after apply)
      + role                                           = (known after apply)
      + service_console_url                            = (known after apply)
      + source                                         = (known after apply)
      + source_id                                      = (known after apply)
      + standby_db                                     = (known after apply)
      + standby_whitelisted_ips                        = []
      + state                                          = "AVAILABLE"
      + subnet_id                                      = (known after apply)
      + supported_regions_to_clone_to                  = (known after apply)
      + system_tags                                    = (known after apply)
      + time_created                                   = (known after apply)
      + time_deletion_of_free_autonomous_database      = (known after apply)
      + time_maintenance_begin                         = (known after apply)
      + time_maintenance_end                           = (known after apply)
      + time_of_last_failover                          = (known after apply)
      + time_of_last_refresh                           = (known after apply)
      + time_of_last_refresh_point                     = (known after apply)
      + time_of_last_switchover                        = (known after apply)
      + time_of_next_refresh                           = (known after apply)
      + time_reclamation_of_free_autonomous_database   = (known after apply)
      + time_until_reconnect_clone_enabled             = (known after apply)
      + timestamp                                      = (known after apply)
      + used_data_storage_size_in_tbs                  = (known after apply)
      + vault_id                                       = (known after apply)

      + customer_contacts {
          + email = (known after apply)
        }

      + scheduled_operations {
          + scheduled_start_time = (known after apply)
          + scheduled_stop_time  = (known after apply)

          + day_of_week {
              + name = (known after apply)
            }
        }
    }

  # module.adb[0].oci_database_autonomous_database_wallet.adb_database_wallet will be created
  + resource "oci_database_autonomous_database_wallet" "adb_database_wallet" {
      + autonomous_database_id = (known after apply)
      + base64_encode_content  = true
      + content                = (known after apply)
      + generate_type          = "SINGLE"
      + id                     = (known after apply)
      + password               = (sensitive value)
    }

Plan: 40 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + COA_Demo_Details = {
      + adb                = [
          + (known after apply),
        ]
      + automation_run_by  = "oracleidentitycloudservice/paola.juarez@oracle.com"
      + bucketname         = null
      + compute_details    = {
          + bastion_instance = {
              + hostname   = "coa-demo-bastion"
              + name       = "coa-demo-bastion"
              + private_ip = (known after apply)
              + public_ip  = (known after apply)
            }
          + web_instances    = {
              + coa-demo-web0 = {
                  + display_name = "coa-demo-web0"
                  + hostname     = "coa-demo-web0"
                  + private_ip   = (known after apply)
                  + web_server   = (known after apply)
                }
              + coa-demo-web1 = {
                  + display_name = "coa-demo-web1"
                  + hostname     = "coa-demo-web1"
                  + private_ip   = (known after apply)
                  + web_server   = (known after apply)
                }
            }
        }
      + lbaas_details      = {
          + coa_lbaas = {
              + backend_set = {
                  + backends  = (known after apply)
                  + listeners = {
                      + coa-demo-listener-443 = {
                          + app_url    = (known after apply)
                          + ip_address = (known after apply)
                          + name       = "coa-demo-listener-443"
                          + port       = 443
                          + protocol   = "HTTP"
                        }
                      + coa-demo-listener-80  = {
                          + app_url    = (known after apply)
                          + ip_address = (known after apply)
                          + name       = "coa-demo-listener-80"
                          + port       = 80
                          + protocol   = "HTTP"
                        }
                    }
                  + name      = "coa-demo-backend-set"
                  + policy    = "ROUND_ROBIN"
                }
              + name        = "coa-demo-load-balancer"
              + private     = false
              + shape       = "10Mbps"
              + subnet      = "coa-demo-public-subnet"
            }
        }
      + networking_details = {
          + internet-gw    = {
              + ig_name = "coa-demo-IG"
            }
          + private-subnet = {
              + dns_label      = "coavcn.prvsubnet"
              + route_table    = "coa-demo-nat-gw-route-table"
              + security_lists = [
                  + "coa-demo-vcn-security-list",
                  + "coa-demo-private-subnet-security-list",
                ]
              + subnet_cidr    = "10.0.0.0/24"
              + subnet_name    = "coa-demo-private-subnet"
            }
          + public-subnet  = {
              + dns_label      = "coavcn.pubsubnet"
              + route_table    = "coa-demo-ig-route-table"
              + security_lists = [
                  + "coa-demo-vcn-security-list",
                  + "coa-demo-public-subnet-security-list",
                ]
              + subnet_cidr    = "10.0.10.0/24"
              + subnet_name    = "coa-demo-public-subnet"
            }
          + route_tables   = {
              + ig_route_table     = {
                  + route_table_id    = (known after apply)
                  + route_table_name  = "coa-demo-ig-route-table"
                  + route_table_rules = [
                      + {
                          + cidr_block        = (known after apply)
                          + description       = "Trafic to public internet to be routed through the IG"
                          + destination       = "0.0.0.0/0"
                          + destination_type  = "CIDR_BLOCK"
                          + network_entity_id = (known after apply)
                        },
                    ]
                }
              + nat_gw_route_table = {
                  + route_table_id    = (known after apply)
                  + route_table_name  = "coa-demo-nat-gw-route-table"
                  + route_table_rules = [
                      + {
                          + cidr_block        = (known after apply)
                          + description       = "Trafic to public internet to be routed through the NAT GW"
                          + destination       = "0.0.0.0/0"
                          + destination_type  = "CIDR_BLOCK"
                          + network_entity_id = (known after apply)
                        },
                    ]
                }
            }
          + security_lists = {
              + coa_private_subnet_sec_list = {
                  + name = "coa-demo-private-subnet-security-list"
                }
              + coa_public_subnet_sec_list  = {
                  + name = "coa-demo-public-subnet-security-list"
                }
              + coa_vcn_level_sec_list      = {
                  + name = "coa-demo-vcn-security-list"
                }
            }
          + vcn            = {
              + vcn_cidr_block = "10.0.0.0/16"
              + vcn_dns_label  = "coavcn"
              + vcn_id         = (known after apply)
              + vcn_name       = "coa-demo-vcn"
            }
        }
      + region             = "eu-frankfurt-1"
    }
  - bucket           = {
      - bucketname = null
    } -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @paolajuarezgomez, Action: `pull_request`*